{
  "id": "EL1200",
  "points": "2 SKS",
  "syllabus": {
    "id": {
      "name": "Pengantar Analisis Rangkaian",
      "description": "Konsep dasar, hukum-2 dasar, metoda analisis, teorema rangkaian, operational amplifier, kapasitor & induktor, rangkaian orde-1, rangkaian orde-2, sinusoida dan fasor, dan analisis sinusoida dalam keadaan tunak.",
      "syllabus": "Konsep Dasar: muatan dan arus, Tegangan, daya dan energi, elemen rangkaian. Hukum dasar: hukum Ohm dan Kirchhoff, seri resistor & pembagi tegangan, resistor paralel dan pembagi arus, konversi delta-Wye. Metode analisis: Nodal dan Mesh. Teorema rangkaian: superposisi, transformasi sumber, teorema Thevenin & Norton, transfer daya maksimum. Operasional Amplifier: ideal op amp, inverter & non-inverter amplifier, rangkaian penguat penjumlah, penguat pengurang, dan penguat cascade. Rangkaian orde pertama: sumber bebas dan “step” respon dari rangkaian RL dan RC , dan fungsi tunggal. Rangkaian Orde kedua : sumber bebas dan “step” respon dari rangkaian seri & parallel RLC. Rangkaian sinusoidal: konsep fasor, dan hubungannya pada elemen rangkaian, pemodelan rangkaian dan analisis steady state orde 1 dan orde 2.",
      "outcomes": "Memahami konsep dasar muatan, arus, tegangan, daya, energi, dan elemen rangkaian.Menerapkan hukum dasar (Ohm & Kirchhoff) untuk analisis rangkaian resistif menggunakan analisis nodal dan mesh.Analisis rangkaian resistif dan menyederhanakan rangkaian kompleks menggunakan berbagai teorema rangkaian listrik (superposisi, transformasi sumber, Thevenin & Norton, transfer daya maksimum).Menganalisis dan merancang rangkaian sederhana menggunakan penguat operasional.Menganalisis rangkaian dengan elemen penyimpan energiMenentukan respon transien dan respon waktu tunak untuk rangkaian orde satu dan orde dua.Melakukan analisis domain frekuensi menggunakan fasor.Menggunakan SPICE untuk menganalisis rangkaian arus searah dan bolak balik.Menggunakan Matlab sebagai perangkat untuk menyelesaikan persoalan rangkaian listrik"
    },
    "en": {
      "name": "Introduction to Circuit Analysis",
      "description": "Basic concepts, basic laws, methods of analysis, circuit theorems, operational amplifier, capacitors and inductors, first-order circuits, second-order circuits, sinusoidal & phasors, and sinusoidal steady-state analysis.",
      "syllabus": "Basic Concept: Charge and current, Voltage, Power and energy, Circuit Elements.Basic Laws: Ohm and Kirchhoff laws, series resistor & voltage divider, parallel resistors and current divider, delta-wye conversion. Methods of analysis: Nodal and Mesh. Circuit theorems: superposition, source transformation, Thevenin & Norton Theorems, maximum power transfer. Operational Amplifier: ideal op amps, inverting & non-inverting amplifier, summing, difference, and cascaded amplifiers.First-order circuits: source free and step response of RL and RC circuits, and singular function. Second-order circuits: source free and step response of series & paralle RLC circuits. Sinusoidal steady-state analysis: phasor concept and its relationships for circuits elements. Kirchhoff laws in frequency domain, AC steady state analysis for RLC circuits.",
      "outcomes": "Understand the fundamental concepts of charge, current, voltage, power, energy, and circuit elements.Apply basic laws (Ohm & Kirchhoff) for analysis resistive networks using nodal and mesh analysis.Analyse resistive networks and simplify complicated networks using various circuit theorems (superposition, source transformation, Thevenin & Norton, maximum power transfer).Analysis and design simple networks containing operational amplifier.Deal with circuit containing energy storage elements.Determine transient and steady state response of the first and second order circuits.Perform phasor frequency domain analysis.Use SPICE to analyst DC and AC circuits.Use Matlab as a tool to solve the network problems."
    }
  }
}
