{
  "id": "IF3151",
  "points": "3 SKS",
  "syllabus": {
    "id": {
      "name": "Interaksi Manusia & Komputer",
      "description": "Kuliah ini membahas mengenai konsep desain, pengenalan karakteristik pengguna, aspek praktis dan penelitian terkait antarmuka pengguna, pengumpulan data, framework analisis, proses desain interaksi, dan berbagai pendekatan untuk mengevaluasi antarmuka interaktif.",
      "syllabus": "Materi yang tercakup di dalamnya meliputi:  •\tKonsep dan Prinsip Desain Interaksi •\tDomain masalah dan Konseptualisasi •\tAspek Kognitif •\tInteraksi Emosional •\tInteraksi Sosial •\tAntamuka dan Interaksi  •\tPengumpulan Data dan Analisis •\tProses Desain Interaksi •\tDesain, Pembangunan Prototype, dan Konstruksi Produk Interaktif •\tUjicoba Usability •\tEvaluasi Analitik",
      "outcomes": "1. Mahasiswa mampu memahami konsep-konsep penting, prinsip, dan aspek manusia di dalam desain interaksi. 2. Mahasiswa mampu membedakan isu desain dan riset yang terkait dengan berbagai tipe interaksi dan antarmuka. 3. Mahasiswa mampu mengidentifikasi permasalahan usability dan user experience dalam kehidupan sehari-hari. 4. Mahasiswa mampu mengaplikasikan pengetahuan konsep dan prinsip desain interaksi untuk membangun produk yang bermanfaat. 5. Mahasiswa mampu melaksanakan ujicona usability dan evaluasi analitik. 6. Mahasiswa mampu mengimplementasikan ide desain yang dimiliki dalam bentuk oral dan tulisan."
    },
    "en": {
      "name": "Human Computer Interaction",
      "description": "This course discusses the Interaction design concepts, human issues, practical & research issues in a wide range of interfaces, data gathering & analysis framework, process of interaction design, and approaches to evaluation of interactive interfaces",
      "syllabus": "The topics discussed in this course are:  •\tInteraction design princples and concepts •\tProblem space and design space conceptualization •\tCognitive aspects •\tEmotional Interactions •\tSocial Interaction •\tInterface and interactions •\tData gathering & analysis •\tProcess of interaction design •\tDesign, prototyping and construction of interactive product •\tUsability testing •\tAnalytical evaluation",
      "outcomes": ""
    }
  }
}
