{
  "id": "IF3250",
  "points": "4 SKS",
  "syllabus": {
    "id": {
      "name": "Proyek Perangkat Lunak",
      "description": "Kuliah ini memberikan gambaran kompleksitas dan pengalaman mengenai pengembangan perangkat lunak skala besar. Mahasiswa memanfaatkan/ menggunakan berbagai platform, framework, dan tools yang biasa dipakai untuk proyek berskala besar. Kuliah ini juga memberikan pengetahuan rekayasa perangkat lunak tingkat lanjut, mencakup Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, dan Performance Engineering.",
      "syllabus": "Definisi perangkat lunak skala besar; berbagai masalah dalam pengembangan perangkat lunak skala besar dan solusinya; abstraksi; SW Pattern; code generator; pengenalan berbagai platform, framework, dan tools; konfigurasi P/L (konsep, tools, practices...) dilengkapi dengan studi kasus berupa proyek pembangunan P/L skala besar dengan mempraktekkan semua teori yang telah diberikan, atau berupa reverse engineering suatu perangkat lunak skala besar untuk mendapatkan modelnya; topik lanjutan di bidang rekayasa perangkat lunak mencakup Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, Performance Engineering",
      "outcomes": "Memahami definisi P/L skala besar serta berbagai persoalan pengembangan P/L skala besarMemahami teknik/metoda terkait dengan pembangunan P/L skala besar, seperti manajemen konfigurasi P/LMengenal dan mengoperasikan beberapa platform, frameworks, DBMS, dan tools yang dipakai untuk mengembangkan P/L skala besar.Melakukan instalasi, mempraktekkan manajemen konfigurasti P/L, serta melakukan Bugs tracking (dalam case study)Mempraktekkan suatu metodologi untuk mengembangkan P/L skala besar secara terukur, dengan suatu studi kasus, atau untuk mengenal struktur dan melakukan reverse engineering terhadap P/L skala besar yang ada termasuk program readingMengetahui beberapa topik lanjutan di Bidang Rekayasa Perangkat Lunak, mencakup Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, and Performance Engineering"
    },
    "en": {
      "name": "Software Project",
      "description": "This course gives an overview of the complexity and experiences of large-scale software development. Students utilize / use a variety of platforms, frameworks, and tools commonly used for large scale software projects. This course also gives advanced topics in software engineering, including Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, and Performance Engineering.",
      "syllabus": "Definition of large-scale software; various problems in large-scale software development and solutions; abstraction; SW Pattern; code generator; introduction of a variety of platforms, frameworks, and tools; software configuration (concepts, tools, practices ...) including a case study of development large-sale; practicing all the theories and practices; the project can be in the form of reverse engineering a large-scale software; advanced topics in software engineering, including Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, and Performance Engineering",
      "outcomes": "Understand the definition of a large-scale S/W and the various problems of large-scale S/W developmentUnderstand the techniques/methods related to large-scale S/W development, such as S/W configuration managementUnderstand and able to operate several platforms, frameworks, DBMS, and tools used to develop large-scale S/W.Able to perform installation, practice S/W configuration management, and Bugs tracking (in case studies)Able to follow and conduct a large-scale S/W methodology with a case study, or to understand the structure and conducting reverse engineering of existing large-scale S/W [including program reading]Understand several topics on advanced software engineering, including Domain Specific Language (DSL) Domain-oriented Design/Analysis/Architecture, Large Scale Software development, and Performance Engineering"
    }
  }
}
