{
  "id": "IF4088",
  "points": "2 (2) SKS",
  "syllabus": {
    "id": {
      "name": "Pengembangan Kemampuan Interpersonal",
      "description": "Matakuliah Pengembangan Kemampuan Interpersonal disediakan untuk mengakomodasi kegiatan mandiri terkait pengembangan soft skills yang dibutuhkan oleh lulusan sarjana informatika. Termasuk di dalam kegiatan mata kuliah ini diantaranya adalah kegiatan pengembangan komunikasi yang efektif, pengembangan kemampuan manajerial atau kepemimpinan, mengelola dinamika tim, mengelola inovasi, dan lain-lain.",
      "syllabus": "Matakuliah Pengembangan Kemampuan Interpersonal (2 sks) disediakan untuk mengakomodasi kegiatan mandiri terkait pengembangan soft skill yang dibutuhkan oleh lulusan sarjana informatika. Termasuk di dalam kegiatan mata kuliah ini diantaranya adalah kegiatan pengembangan komunikasi yang efektif, pengembangan kemampuan manajerial atau kepemimpinan, mengelola dinamika tim, mengelola inovasi, dan lain-lain. Kegiatan dapat berupa keikutsertaan dalam kuliah yang diselenggarakan oleh Prodi berupa topik khusus terkait soft skills yang diampu oleh dosen industri atau keikutsertaan dalam kuliah atau pelatihan yang diselenggarakan insitusi lain. Dalam kegiatan ini prodi mengumumkan kegiatan yang dapat dilakukan pada semester berjalan. Kegiatan ini dapat diselenggarakan bersama dengan rekanan Prodi Informatika atau STEI dengan bimbingan staf dosen Informatika.",
      "outcomes": "Mahasiswa mampu menunjukkan keterampilan soft skills tertentuMahasiswa mampu menyampaikan secara tertulis maupun lisan kepada audiens luas terkait dengan capaian belajarnya (disesuaikan dengan topik yang diambil)"
    },
    "en": {
      "name": "Interpersonal Skills Development",
      "description": "The Interpersonal Skills Development course is provided to accommodate independent activities related to the development of soft skills needed by informatics graduates. Included in the activities of this course include activities for developing effective communication, developing managerial or leadership abilities, managing team dynamics, managing innovation, and so on.",
      "syllabus": "The Interpersonal Skills Development course (2 credits) is provided to accommodate independent activities related to the development of soft skills needed by informatics graduates. Included in the activities of this course include activities for developing effective communication, developing managerial or leadership abilities, managing team dynamics, managing innovation, and so on. Activities can be in the form of participation in lectures organized by the Prodi in the form of special topics related to soft skills taught by industry lecturers or participation in lectures or training held by other institutions. In this activity the study program announces activities that can be carried out in the current semester. This activity can be held together with Informatics Study Program partners or STEI with the guidance of Informatics lecturer staff.",
      "outcomes": ""
    }
  }
}
