{
  "id": "IF4085",
  "points": "2 SKS",
  "syllabus": {
    "id": {
      "name": "Topik Khusus Informatika A",
      "description": "Matakuliah Kapita Selekta bidang Informatika A disediakan untuk mengakomodasi kegiatan studi mandiri maupun terstruktur yang diampu oleh Prodi Informatika, industri atau universitas lain terkait kompetensi bidang Informatika yang tidak ada di dalam perkuliahan wajib atau pilihan lainnya. Topik yang dikaji dapat berupa topik-topik kekinian yang belum tercakup dalam kurikulum saat ini atau pendalaman dari topik yang sudah ada di dalam kurikulum.",
      "syllabus": "Matakuliah Kapita Selekta bidang Informatika A (2 sks) disediakan untuk mengakomodasi kegiatan studi atau kajian keilmuan baik secara mandiri atau terstruktur yang diampu oleh Prodi Informatika, industri atau universitas lain terkait kompetensi bidang Informatika yang tidak ada di dalam perkuliahan wajib atau pilihan lainnya. Kegiatan dapat berupa keikutsertaan dalam kuliah yang diselenggarakan oleh Prodi berupa topik khusus yang diampu oleh dosen industri atau keikutsertaan dalam kuliah yang diselenggarakan insitusi lain. Dalam kegiatan ini prodi mengumumkan kegiatan yang dapat dilakukan pada semester berjalan. Kegiatan ini dapat diselenggarakan bersama dengan rekanan Prodi Informatika atau STEI dengan bimbingan staf dosen Informatika.",
      "outcomes": "Mahasiswa mampu memahami topik khusus yang ditawarkan pada perkuliahan.Mahasiswa mampu menyampaikan secara tertulis maupun lisan kepada audiens luas terkait dengan capaian belajarnya (disesuaikan dengan topik yang diambil)."
    },
    "en": {
      "name": "Special Topics in Informatics A",
      "description": "The Kapita Selekta subject in Informatics A is provided to accommodate independent and structured study activities that are managed by the Informatics Study Program, other industries or universities related to competencies in the Informatics field that are not in compulsory lectures or other options. The topics studied can be in the form of current topics that have not been covered in the current curriculum or a deepening of topics that are already in the curriculum.",
      "syllabus": "The Capita Selekta subject in Informatics A (2 credits) is provided to accommodate study activities or scientific studies either independently or structured by the Informatics Study Program, other industries or universities related to Informatics field competencies that are not in compulsory lectures or other options. Activities can be in the form of participation in lectures organized by the Studi Program in the form of special topics that are taught by industry lecturers or participation in lectures held by other institutions. In this activity the study program announces activities that can be carried out in the current semester. This activity can be held together with Informatics Study Program partners or STEI with the guidance of Informatics lecturer staff.",
      "outcomes": ""
    }
  }
}
