{
  "id": "IF4061",
  "points": "3 SKS",
  "syllabus": {
    "id": {
      "name": "Visualisasi Data dan Informasi",
      "description": "Mata kuliah ini menjelaskan tentang penyampaian informasi melalui media visual yang berbasis komputer secara efektif. Kuliah ini bertujuan memberikan wawasan mengenai prinsip dan peranan visualisasi dalam interaksi manusia dengan informasi, serta memberikan panduan pengembangan aplikasi visualisasi interaktif sehingga mahasiswa dapat menerapkan pengetahuan yang ada di dalam kelas ke dalam kehidupan sehari-hari. Kuliah ini bersifat multidisiplin yang mencakup aspek biologi, psikologi komunikasi visual, dan teknologi informasi.",
      "syllabus": "Bahasan dalam kuliah ini bertujuan memberikan gambaran mengenai sistem yang melibatkan manusia sebagai konsumen informasi dan komputer yang mengolah dan menyajikan informasi, serta teknik-teknik yang mengoptimalkan komunikasi informasi dari komputer ke manusia sesuai dengan tujuan tertentu. Kuliah ini membahas mengenai sistem persepsi visual pada manusia, representasi objek visual, karakteristik dan analisis data dan informasi, transformasi data, teknik penggambaran, interaksi, dan metode rekayasa aplikasi yang menggunakan visualisasi dan metode evaluasi terhadap teknik visualisasi yang digunakan. Selain itu kuliah ini juga mencoba mengeksplorasi teknik dan media baru yang sedang berkembang untuk mendorong kolaborasi multidisiplin.",
      "outcomes": "Mahasiswa mampu menjelaskan prinsip dan tujuan dari VisualisasiMahasiswa memiliki pemahaman terhadap aspek persepsi visual pada manusia dan wawasan tentang representasi objek visualMahasiswa memiliki pemahaman terhadap karakteristik data dan mampu membuat pemetaan dari ranah data ke representasi visualMahasiswa memiliki wawasan terhadap teknik-teknik visualisasi serta mengevaluasi teknik-teknik tersebut sesuai dengan kebutuhan dan batasanMahasiswa mampu menerapkan pengetahuan dan memanfaatkan kakas yang ada untuk merancang dan membangun visualisasi terhadap data dari suatu kasus"
    },
    "en": {
      "name": "Information and Data Visualisation",
      "description": "This course explains about how to effectively presenting information using computer-based visual media. The course objective is to provide insight about principle and role of visualization in human interaction with information, and to provide guidance about developing interactive visualization application so that students are able to apply knowledge acquired in class to everyday use. This course is inherently multi-discipline which covers aspects from Biology, Psychology of Visual Communication, and Information Technology.",
      "syllabus": "The objective of the course topics is to provide description about system involving human as information consumer and computer that process and presenting information, and techniques that optimize information communication from computer to human to achieve a spesific goal. This course covers human visual perception system, visual object representation, data and information characteristics and analysis,  data transformation, rendering/display techniques, interaction, engineering methods for interactive visualization application development, and methodology to evaluate visualization techniques. This course also explores new media and novel technique to promote multi-discipline collaboration.",
      "outcomes": "Students are able to explain the principles and objectives of VisualizationStudents have an understanding of aspects of visual perception in humans and insights about visual object representationStudents have an understanding of the characteristics of the data and are able to make mapping from the realm of data to visual representationStudents have insight into visualization techniques and evaluate these techniques according to their needs and limitationsStudents are able to apply knowledge and use existing tools to design and build visualizations of data from a case"
    }
  }
}
