{
  "id": "KU1024",
  "points": "2 SKS",
  "syllabus": {
    "id": {
      "name": "Bahasa Inggris",
      "description": "Melatih kemampuan berpikir kritis mahasiswa dalam kegiatan membaca dan menulis dalam bidang akademis.",
      "syllabus": "Melatih kemampuan berpikir kritis mahasiswa dalam kegiatan membaca yang meliputi (a) sebelum kegiatan membaca dilakukan, (b) pada saat kegiatan membaca berlangsung , dan (c) setelah kegiatan membaca berakhir. Kemampuan berpikir kritis yang dilatih sebelum kegiatan membaca dilakukan meliputi (1) kemampuan mengecek bagian-bagian buku dalam rangka menentukan apakah suatu buku relevan atau tidak dengan kebutuhan membaca mahasiswa. Sedangkan (2) pada saat kegiatan membaca berlansung , mahasiswa dilatih secara kritis mengidentifikasi ide-ide yang relevan sesuai kebutuhan membacanya. dengan cara melakukan anotasi. Selain itu, mahasiswa juga dilatih untuk dapat mengidentifikiasi berbagai ide yang bersifat pro, kontra, dan sanggahan (refutation) Pada saat yang bersamaan, mahasiswa juga dilatih untuk memanfaatkan pengetahuan tertentu untuk mengetahui makna suatu kata dengan cara menebak. Terakhir, (3) pada saat kegiatan membaca berakhir, mahasiswa dilatih untuk dapat secara kritis merespon ide-ide yang ada dalam artikel yang telah mereka baca dalam bentuk summary-response essay; mereka juga dilatih meringkas dan melakukan parafrase kalimat yang memuat ide-ide yang ada dalam artikel yang mereka baca serta menuliskan kutipan yang benar dengan baik.",
      "outcomes": ""
    },
    "en": {
      "name": "English",
      "description": "Train the students' critical thinking skills in reading activities and in writing in academic field.",
      "syllabus": "Train the students' critical thinking skills in reading activities that include (a) before the reading is done, (b) at the time of reading is in progress, and (c) after the reading is over. The critical thinking skills are trained before the reading activity is conducted include (1) the ability to check the book parts in order to determine whether or not a book is relevant to the students’ reading needs. While (2) the reading activity is in progress, the students are trained to critically identify the ideas that are relevant to their reading needs by means of annotations. In addition, the students are also trained to identify various ideas, such as the main ideas, supporting ideas, counter arguments, and refutations. At the same time, students are also trained to make the best use of their linguistic knowledge and world knowledge as well as the contexts in the reading text to know the meaning of an unfamiliar word by guessing. Finally, (3) when the reading is over, the students are trained to be able to critically summarize in their own words (paraphrasing) the article before they respond the article in a summary-response essay while applying the correct citation in their essay.",
      "outcomes": ""
    }
  }
}
